import { IWikiDetailContents } from "src/interface/interfaceWiki";

export const DWikiDetailContents: Array<IWikiDetailContents> = [
  {
    title: "코딩 공부 시작하기",
    id: 1,
    contents:
      "이 위키 디테일 페이지에 관하여 설명 드리고자 본문에 내용을 쓰도록 하겠습니다. 자동 링크 생성은 특수기호가 감싸고 있는 타이틀을 찾아 자동링크를 생성합니다. 본문에서는 특수기호가 보이지 않게 되어있지만, 수정하기에서는 특수기호를 보실 수 있으며, 다른 타이틀을 자동링크 생성하고 싶으실 때, 위와 설명과 같이 수정하고 저장해주시면 되겠습니다. 또한 저장했을 시, 새로고침을 하면 데이터가 사라지지 않도록 persist를 사용하여 본문 상태값을 저장하였습니다. 이곳은 코딩 공부 시작하기 1번 입니다. 다음 페이지인 *HTML/CSS로 웹사이트 만들기*로 넘어가실 수 있으며 타이틀 추가시 자동 링크 생성 됩니다. 아래부터는 더미 데이터를 위하여 뉴스 복붙입니다. 컨퍼런스 참가를 희망하는 외부 IT 개발자와 전공 학생, 업계 관계자 등은 행사 홈페이지에서 신청이 가능하다. 2021년 처음 개최돼 올해로 3회차를 맞는 ‘HMG 개발자 컨퍼런스’는 SDV(Software Defined Vehicle)로의 대전환을 추진하는 과정에서 현대차그룹 개발자들이 연구하고 개발하며 겪었던 경험과 노하우를 외부에 공유·소통하며 함께 성장하기 위해 마련된 연례행사다. 이를 위해 현대자동차, 기아, 42dot, 모셔널(Motional), 현대모비스, 현대오토에버 등 9개 사에서 근무 중인 80여명의 개발자들이 자발적으로 행사에 참여했다. 현대차그룹은 이곳에서 SDV를 비롯해 AI, 자율주행, 모빌리티 서비스를 주제로 주요 연사의 발표와 개발자들의 연구사례를 공개한다. 이번 행사에서는 △현대차·기아 SDV본부 및 42dot을 총괄하는 송창현 사장이 오프닝과 SDV를 주제로 키노트 발표를 △자율주행사업부 유지한 전무가 자율주행 기술을 주제로 키노트 발표를 △모셔널 마이클 세비딕(Michael Sebetich) 엔지니어링 부사장과 △고려대학교 인공지능학과 이상근 교수가 각각 모빌리티 서비스와 AI를 주제로 강연을 진행하고, 그 외 주제별 담당 개발자들이 다양한 개발 노하우를 공유할 예정이다.",
  },
  {
    title: "HTML/CSS로 웹사이트 만들기",
    id: 2,
    contents:
      "HTML/CSS로 웹사이트 만들기 본문입니다. 다음 *JavaScript 기초* 링크를 걸어두었으니 이동 가능합니다. 아래 본문은 첫 단 본문과 같으며 읽지 않으셔도 되는 부분 입니다. 컨퍼런스 참가를 희망하는 외부 IT 개발자와 전공 학생, 업계 관계자 등은 행사 홈페이지에서 신청이 가능하다. 2021년 처음 개최돼 올해로 3회차를 맞는 ‘HMG 개발자 컨퍼런스’는 SDV(Software Defined Vehicle)로의 대전환을 추진하는 과정에서 현대차그룹 개발자들이 연구하고 개발하며 겪었던 경험과 노하우를 외부에 공유·소통하며 함께 성장하기 위해 마련된 연례행사다. 이를 위해 현대자동차, 기아, 42dot, 모셔널(Motional), 현대모비스, 현대오토에버 등 9개 사에서 근무 중인 80여명의 개발자들이 자발적으로 행사에 참여했다. 현대차그룹은 이곳에서 SDV를 비롯해 AI, 자율주행, 모빌리티 서비스를 주제로 주요 연사의 발표와 개발자들의 연구사례를 공개한다. 이번 행사에서는 △현대차·기아 SDV본부 및 42dot을 총괄하는 송창현 사장이 오프닝과 SDV를 주제로 키노트 발표를 △자율주행사업부 유지한 전무가 자율주행 기술을 주제로 키노트 발표를 △모셔널 마이클 세비딕(Michael Sebetich) 엔지니어링 부사장과 △고려대학교 인공지능학과 이상근 교수가 각각 모빌리티 서비스와 AI를 주제로 강연을 진행하고, 그 외 주제별 담당 개발자들이 다양한 개발 노하우를 공유할 예정이다.",
  },
  {
    title: "Python 기초",
    id: 3,
    contents:
      "Python 기초 본문입니다. 자동링크 *객체지향 프로그래밍* 생성하였습니다. 아래 본문은 첫 단 본문과 같으며 읽지 않으셔도 되는 부분 입니다. 컨퍼런스 참가를 희망하는 외부 IT 개발자와 전공 학생, 업계 관계자 등은 행사 홈페이지에서 신청이 가능하다. 2021년 처음 개최돼 올해로 3회차를 맞는 ‘HMG 개발자 컨퍼런스’는 SDV(Software Defined Vehicle)로의 대전환을 추진하는 과정에서 현대차그룹 개발자들이 연구하고 개발하며 겪었던 경험과 노하우를 외부에 공유·소통하며 함께 성장하기 위해 마련된 연례행사다. 이를 위해 현대자동차, 기아, 42dot, 모셔널(Motional), 현대모비스, 현대오토에버 등 9개 사에서 근무 중인 80여명의 개발자들이 자발적으로 행사에 참여했다. 현대차그룹은 이곳에서 SDV를 비롯해 AI, 자율주행, 모빌리티 서비스를 주제로 주요 연사의 발표와 개발자들의 연구사례를 공개한다. 이번 행사에서는 △현대차·기아 SDV본부 및 42dot을 총괄하는 송창현 사장이 오프닝과 SDV를 주제로 키노트 발표를 △자율주행사업부 유지한 전무가 자율주행 기술을 주제로 키노트 발표를 △모셔널 마이클 세비딕(Michael Sebetich) 엔지니어링 부사장과 △고려대학교 인공지능학과 이상근 교수가 각각 모빌리티 서비스와 AI를 주제로 강연을 진행하고, 그 외 주제별 담당 개발자들이 다양한 개발 노하우를 공유할 예정이다.",
  },
  { title: "JavaScript 기초", id: 4, contents: "JavaScript 기초 본문" },
  {
    title: "비개발자를 위한 SQL 데이터 분석",
    id: 5,
    contents: "비개발자를 위한 SQL 데이터 분석 본문",
  },
  { title: "React 프론트 개발", id: 6, contents: "React 프론트 개발 본문" },
  { title: "Next.js 웹 개발", id: 7, contents: "Next.js 웹 개발 본문" },
  { title: "Node.js 백엔드 개발", id: 8, contents: "Node.js 백엔드 개발 본문" },
  { title: "컴퓨터 아키텍처", id: 9, contents: "컴퓨터 아키텍처 본문" },
  {
    title: "객체지향 프로그래밍",
    id: 10,
    contents: "객체지향 프로그래밍 본문",
  },
  {
    title: "Javascript 프론트 개발자",
    id: 11,
    contents: "Javascript 프론트 개발자 본문",
  },
  {
    title: "Javascript 백엔드 개발자",
    id: 12,
    contents: "Javascript 백엔드 개발자 본문",
  },
  {
    title: "데이터 사이언티스트",
    id: 13,
    contents: "데이터 사이언티스트 본문",
  },
  { title: "딥 러닝", id: 14, contents: "딥 러닝 본문" },
];
